# DataFrames
- main tool when working with panda
- can add new column with df['new'] = df['A'] + df['B'] (adding 2 series)
- delete column with df.drop('col', axis = 1, inplace = True) axis = 1 is column, and inplace mean change will occur
- Select without drop df.drop('row', axis =0) this will show dataframe without that specific row
- select column with df['col'] or df.loc['col']
- selec row with df.loc['row'] or df.iloc[0]

In [1]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])
#generate 5x4 maxtrix
#data argument
# index arugment
# collumn
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [9]:
# a list of column and coressponding row
# dataframe is series that share index
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [11]:
type(df['W']) # a series type

pandas.core.series.Series

In [12]:
type(df) # a data frame

pandas.core.frame.DataFrame

In [15]:
#always use bracket notation
#can use sql like .collumnName (can be hard, since various method is available, can be override and python will be confused)
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [16]:
df[['W','Z']] # get multiple series

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

#  Create new column

In [17]:
df['new'] =  df['W'] + df['Y'] #use artihmetic operation

In [18]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [20]:
df.drop('new', axis = 1)
#get error KeyError: "['new'] not found in axis"
# df.drop('new')

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [21]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [23]:
df.drop('new', axis =1, inplace = True) #require inPlace since deosnt want to lose data => inplace = True
#change will occur
#DROPPING COLUMN

In [24]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [28]:
#drop row (showing data but not showing E)
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [31]:
df.shape

(5, 4)

In [30]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [32]:
#why axis = 0 is row, axis  = 1 is column
#5 rows ABCDE, 4 Column 
# taken from the shape
#on index 0  we have  A B C D E
#on index 1 we Have WXYZ

In [35]:
df[['Y','Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752
E  0.238127  1.996652

# Selecting Rows use

In [52]:
df.loc['C'] #1st way

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [44]:
#2nd way numerical way
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

# Sub set of row and column

In [45]:
df.loc['B','Y']

0.16690463609281317

In [46]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905